In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1 = {"India": 1380004385, "Russia": 145934462, "Japan" : 126476461}
ds = pd.Series(dict1)
ds

India     1380004385
Russia     145934462
Japan      126476461
dtype: int64

In [3]:
ds.index.name = "Country" 
ds.name = "population"
ds

Country
India     1380004385
Russia     145934462
Japan      126476461
Name: population, dtype: int64

In [4]:
ds/100000

Country
India     13800.04385
Russia     1459.34462
Japan      1264.76461
Name: population, dtype: float64

In [5]:
ds *3

Country
India     4140013155
Russia     437803386
Japan      379429383
Name: population, dtype: int64

In [6]:
np.exp(ds)

/home/vidya/.local/lib/python3.8/site-packages/pandas/core/arraylike.py:397: RuntimeWarning: overflow encountered in exp
  result = getattr(ufunc, method)(*inputs, **kwargs)

Country
India     inf
Russia    inf
Japan     inf
Name: population, dtype: float64

In [7]:
ds.describe()

count    3.000000e+00
mean     5.508051e+08
std      7.181735e+08
min      1.264765e+08
25%      1.362055e+08
50%      1.459345e+08
75%      7.629694e+08
max      1.380004e+09
Name: population, dtype: float64

In [8]:
# dict to series 

d = {
    "litRate" : pd.Series([95.02, 55.61, 98.5], index = ["India", "China", "Israel"]),
    "Population" : pd.Series([1380004385, 1480333385, 100022376], index = ["India", "China", "Israel"]),
    "Capital" : pd.Series(["New Delhi", "Beijing", "Jerusalem"], index = ["India", "China", "Israel"]),   
}
df = pd.DataFrame(d)
df

        litRate  Population    Capital
India     95.02  1380004385  New Delhi
China     55.61  1480333385    Beijing
Israel    98.50   100022376  Jerusalem

In [18]:
df.dtypes

litRate       float64
Population      int64
Capital        object
dtype: object

In [9]:
df2 = pd.DataFrame({"A": [22,33,44,None, 66, 20], 
                    "B":[55, 66, None, 99, 56, 78],
                    "C": [67, None, None, 35, 87, 54],
                    "D": [32, None, 36, 21, None, 89],
                    "E": [86, None, 67, 35, 87, 34]})
df2

      A     B     C     D     E
0  22.0  55.0  67.0  32.0  86.0
1  33.0  66.0   NaN   NaN   NaN
2  44.0   NaN   NaN  36.0  67.0
3   NaN  99.0  35.0  21.0  35.0
4  66.0  56.0  87.0   NaN  87.0
5  20.0  78.0  54.0  89.0  34.0

In [10]:
df2.dropna()  # Drops rows where None values are present

      A     B     C     D     E
0  22.0  55.0  67.0  32.0  86.0
5  20.0  78.0  54.0  89.0  34.0

In [11]:
df2.dropna(axis=1) # Column with None value

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5]

In [12]:
df2.dropna(thresh = 3) # Min 3 values must be present in row to be not deleted

      A     B     C     D     E
0  22.0  55.0  67.0  32.0  86.0
2  44.0   NaN   NaN  36.0  67.0
3   NaN  99.0  35.0  21.0  35.0
4  66.0  56.0  87.0   NaN  87.0
5  20.0  78.0  54.0  89.0  34.0

In [13]:
df2.dropna(how="all")

      A     B     C     D     E
0  22.0  55.0  67.0  32.0  86.0
1  33.0  66.0   NaN   NaN   NaN
2  44.0   NaN   NaN  36.0  67.0
3   NaN  99.0  35.0  21.0  35.0
4  66.0  56.0  87.0   NaN  87.0
5  20.0  78.0  54.0  89.0  34.0

In [14]:
df2.dropna(how="any")

      A     B     C     D     E
0  22.0  55.0  67.0  32.0  86.0
5  20.0  78.0  54.0  89.0  34.0

In [15]:
df2.dropna(subset = ["A", "B"])

      A     B     C     D     E
0  22.0  55.0  67.0  32.0  86.0
1  33.0  66.0   NaN   NaN   NaN
4  66.0  56.0  87.0   NaN  87.0
5  20.0  78.0  54.0  89.0  34.0

In [16]:
df2["B"].fillna(value= 777)

0     55.0
1     66.0
2    777.0
3     99.0
4     56.0
5     78.0
Name: B, dtype: float64

In [17]:
pd.isna(df2).sum()

A    1
B    1
C    2
D    2
E    1
dtype: int64